# Select Columns

There are SEVEN ways to select columns using ColumnTransformer:

1) column name

2) integer position

3) slice

4) boolean mask

5) regex pattern

5) dtypes to include

6) dtypes to exclude

In [1]:
import pandas as pd

C:\INSTALLED_SOFTWARES\Anaconda\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
data = pd.read_csv("http://bit.ly/kaggletrain",nrows=5)
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [3]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
columns = ['Sex', 'Embarked','Age']
features = data[columns]

In [5]:
features

      Sex Embarked  Age
0    male        S   22
1  female        C   38
2  female        S   26
3  female        S   35
4    male        S   35

##### now import sklearn library

In [6]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import make_column_transformer, make_column_selector

In [7]:
ohe = OneHotEncoder()

In [13]:
ct = make_column_transformer((ohe,['Sex','Embarked'])) # column name
ct = make_column_transformer((ohe,[0,1])) # integer position
ct = make_column_transformer((ohe,slice(1,3))) # slice
ct = make_column_transformer((ohe, [True, True, False])) # boolean
ct = make_column_transformer((ohe, make_column_selector(pattern='E|S'))) # regex
ct = make_column_transformer((ohe, make_column_selector(dtype_include=object))) # dtype to include
ct = make_column_transformer((ohe, make_column_selector(dtype_exclude='number'))) # dtype to exclude

In [14]:
transformed_data_col = ct.fit_transform(features)

In [15]:
transformed_data_col

array([[0., 1., 0., 1.],
       [1., 0., 1., 0.],
       [1., 0., 0., 1.],
       [1., 0., 0., 1.],
       [0., 1., 0., 1.]])

### So, Here we have all all different ways to select column using Column Transformer in Scikit-learn